# IsValidFixedNumberOfPoints Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DividedPath..::..IsValidFixedNumberOfPoints Method
DividedPath Class See Also
---
Identifies if the indicated number of points is valid for assignment to a DividedPath with a layout type 'FixedNumber'.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static bool IsValidFixedNumberOfPoints(
	int fixedNumberOfPoints
)
```

Visual Basic
---
```text
Public Shared Function IsValidFixedNumberOfPoints ( _
	fixedNumberOfPoints As Integer _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsValidFixedNumberOfPoints(
	int fixedNumberOfPoints
)
```

# ### Parameters
fixedNumberOfPoints
    Type: System..::..Int32
# See Also
DividedPath Class
Autodesk.Revit.DB Namespace